def solution(a, b, n):
    answer = 0

    while n >= a:
        leave = n - (n//a)*a
        receive = (n//a)*b
        n = leave + receive
        answer += receive

    return answer

print(solution(2, 1, 20))
print(solution(3, 1, 20))

print(solution(3, 2, 20)) ## answer -> 36이 나와야 함

#
# 3, 2, 20 일때
#
# 기본 남은거: 20 - (20//3)*3 = 2
# 받은거 : (20//3)*2 = 12
#
# 총 남은거: 2 + 12 = 14
#
#
# 기본 남은거: 14 - (14//3)*3 = 2
# 받은거: (14//3) * 2 = 8
#
# 총 남은거: 10
#
# 기본 남은거: 10 - (10//3)*3 = 1
# 받은거: (10//3) * 2 = 6
#
# 총 남은거: 7
#
# 기본 남은거: 7 - (7//3) * 3 = 1
# 받은거: (7//3) * 2 = 4
#
# 총 남은거: 5
#
# 기본 남은거: 5 - 3 = 2
# 받은거: 2
#
# 총 남은거: 4
#
#
# 기본 남은거: 4 - 3 = 1
# 받은거: 2
#
# 총 남은거: 3
#
# 기본 남은거: 3 - 3 = 0
# 받은거: 2
#
# 총 남은거: 2
